# Assignment 8 [Group and Join]

In [1]:
# Just run this cell
import warnings
warnings.filterwarnings("ignore", message="The 'warn' parameter of")

from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

In [2]:
salesperson = Table(['Salesperson ID', 'Salesperson Name', 'City', 'Commission']).with_rows([
    ['5001', 'James Hoog',  'New York', 0.15],
    ['5002', 'Nail Knite',  'Paris',    0.13],
    ['5005', 'Amoli Alex',  'London',   0.11],
    ['5006', 'Mike Lyon',   'Paris',    0.14],
    ['5007', 'Adam Plank',  'Rome',     0.13],
    ['5003', 'Layla Ahmad', 'San Jose', 0.12]
])

customer = Table(['Customer ID', 'Customer Name', 'City', 'Grade', 'Salesperson ID']).with_rows([
    ['3002', 'Nick Rimando',   'New York',   100, '5001'],
    ['3007', 'Brad Davis',     'New York',   200, '5001'],
    ['3005', 'Graham Zusi',    'California', 200, '5002'],
    ['3008', 'Jilian Green',   'London',     300, '5002'],
    ['3004', 'Fabian Johnson', 'Paris',      300, '5006'],
    ['3009', 'Gina Cameron',   'Berlin',     100, '5003'],
    ['3003', 'Helen Li',       'Moscow',     200, '5007'],
    ['3001', 'Corey Jackson',  'London',     200, '5005']
])

orders = Table(['Order Number', 'Purchase Amount', 'Order Date', 'Customer ID', 'Salesperson ID']).with_rows([
    ['70001', '$150.50',   '2019-10-05', '3005', '5002'],
    ['70009', '$270.65',   '2019-09-10', '3001', '5005'],
    ['70002', '$65.26',    '2019-10-05', '3002', '5001'],
    ['70004', '$110.50',   '2019-08-17', '3009', '5003'],
    ['70007', '$948.50',   '2019-09-10', '3005', '5002'],
    ['70005', '$2,400.60', '2019-07-27', '3007', '5001'],
    ['70008', '$5,760.00', '2019-09-10', '3002', '5001'],
    ['70010', '$1,983.43', '2019-10-10', '3004', '5006'],
    ['70003', '$2,480.40', '2019-10-10', '3009', '5003'],
    ['70012', '$250.45',   '2019-06-27', '3008', '5002'],
    ['70011', '$75.29',    '2019-08-17', '3003', '5007'],
    ['70013', '$3,045.60', '2019-04-25', '3002', '5001']
])

**Question 1.** Use the `join` method to make the table below.

In [3]:
# Question 1

Salesperson Name | Customer Name  | City
James Hoog       | Nick Rimando   | New York
James Hoog       | Brad Davis     | New York
Nail Knite       | Graham Zusi    | Paris
Nail Knite       | Jilian Green   | Paris
Layla Ahmad      | Gina Cameron   | San Jose
Amoli Alex       | Corey Jackson  | London
Mike Lyon        | Fabian Johnson | Paris
Adam Plank       | Helen Li       | Rome

**Question 2.** Use the `join` method to make the table below.

In [4]:
# Question 2

Order Number | Purchase Amount | Customer Name  | City
70009        | $270.65         | Corey Jackson  | London
70002        | $65.26          | Nick Rimando   | New York
70008        | $5,760.00       | Nick Rimando   | New York
70013        | $3,045.60       | Nick Rimando   | New York
70011        | $75.29          | Helen Li       | Moscow
70010        | $1,983.43       | Fabian Johnson | Paris
70001        | $150.50         | Graham Zusi    | California
70007        | $948.50         | Graham Zusi    | California
70005        | $2,400.60       | Brad Davis     | New York
70012        | $250.45         | Jilian Green   | London
... (2 rows omitted)

**Question 3.** Use the `join` method to make the table below.

In [5]:
# Question 3

Customer Name  | City       | Salesperson Name | Commission
Nick Rimando   | New York   | James Hoog       | 0.15
Brad Davis     | New York   | James Hoog       | 0.15
Graham Zusi    | California | Nail Knite       | 0.13
Jilian Green   | London     | Nail Knite       | 0.13
Gina Cameron   | Berlin     | Layla Ahmad      | 0.12
Corey Jackson  | London     | Amoli Alex       | 0.11
Fabian Johnson | Paris      | Mike Lyon        | 0.14
Helen Li       | Moscow     | Adam Plank       | 0.13

**Question 4.** Use the `join` method to make the table below.

**Note:** Only display the customers whose appointed salesperson gets a commission of more than 12%.

In [6]:
# Question 4

Salesperson Name | Customer Name  | City     | Commission
James Hoog       | Nick Rimando   | New York | 0.15
James Hoog       | Brad Davis     | New York | 0.15
Nail Knite       | Graham Zusi    | Paris    | 0.13
Nail Knite       | Jilian Green   | Paris    | 0.13
Mike Lyon        | Fabian Johnson | Paris    | 0.14
Adam Plank       | Helen Li       | Rome     | 0.13

**Question 5.** Use the `join` method to make the table below.

**Note 1:** Only display the customers whose appointed salesperson lives in a different city.

**Note 2:** Relabel the column names to `Customer City` and `Salesperson City`.

**Hint 1:** The `.relabled` method allows you to relabel multiple comluns using arrays. For more information on the `.relabled` method [click here](http://data8.org/datascience/_autosummary/datascience.tables.Table.relabeled.html) to look at the documentation.

In [7]:
# Question 5

Customer Name  | Customer City | Salesperson Name | Salesperson City | Commission
Graham Zusi    | Paris         | Nail Knite       | California       | 0.13
Jilian Green   | Paris         | Nail Knite       | London           | 0.13
Gina Cameron   | San Jose      | Layla Ahmad      | Berlin           | 0.12
Corey Jackson  | London        | Amoli Alex       | London           | 0.11
Fabian Johnson | Paris         | Mike Lyon        | Paris            | 0.14
Helen Li       | Rome          | Adam Plank       | Moscow           | 0.13

**Question 6.** Use the `join` method to make the table below.

In [8]:
# Question 6

Order Number | Order Date | Purchase Amount | Customer Name | Grade | Salesperson Name | Commission
70002        | 2019-10-05 | $65.26          | Nick Rimando  | 100   | James Hoog       | 0.15
70008        | 2019-09-10 | $5,760.00       | Nick Rimando  | 100   | James Hoog       | 0.15
70013        | 2019-04-25 | $3,045.60       | Nick Rimando  | 100   | James Hoog       | 0.15
70005        | 2019-07-27 | $2,400.60       | Brad Davis    | 200   | James Hoog       | 0.15
70001        | 2019-10-05 | $150.50         | Graham Zusi   | 200   | Nail Knite       | 0.13
70007        | 2019-09-10 | $948.50         | Graham Zusi   | 200   | Nail Knite       | 0.13
70012        | 2019-06-27 | $250.45         | Jilian Green  | 300   | Nail Knite       | 0.13
70004        | 2019-08-17 | $110.50         | Gina Cameron  | 100   | Layla Ahmad      | 0.12
70003        | 2019-10-10 | $2,480.40       | Gina Cameron  | 100   | Layla Ahmad      | 0.12
70009        | 2019-09-10 | $270.65         | Corey Jackson | 200   | Amoli Alex       | 0.11
... (2 rows omitted)

### Optional Challenge

**Question 7.** Use the `join` method to make the table below.

**Note 1:** You will need functions to convert the `Purchase Amount` from a string to a number and to calculate the `Commission Earned`.

**Hint 1:** You can use the `.apply` method to call a function on each item in an array.

**Hint 2:** The `.replace` method to remove characters from any position in a string. For more information on the `.replace` method [click here](http://data8.org/fa19/python-reference.html) to look at the documentation.

**Hint 3:** A function can have multiple arguments. Define a function that accepts the purchase amount and the commission percent, then calculates the commission earned.

**Hint 4:** The `CurrencyFormatter` will display a `float` with the '\$' symbol. For more information on `CurrencyFormatter` [click here](http://data8.org/datascience/formats.html) to look at the documentation.

In [9]:
# Question 7

Order Number | Order Date | Purchase Amount | Customer Name | Grade | Salesperson Name | Commission | Commission Earned
70002        | 2019-10-05 | $65.26          | Nick Rimando  | 100   | James Hoog       | 0.15       | $9.79
70008        | 2019-09-10 | $5,760.00       | Nick Rimando  | 100   | James Hoog       | 0.15       | $864.00
70013        | 2019-04-25 | $3,045.60       | Nick Rimando  | 100   | James Hoog       | 0.15       | $456.84
70005        | 2019-07-27 | $2,400.60       | Brad Davis    | 200   | James Hoog       | 0.15       | $360.09
70001        | 2019-10-05 | $150.50         | Graham Zusi   | 200   | Nail Knite       | 0.13       | $19.57
70007        | 2019-09-10 | $948.50         | Graham Zusi   | 200   | Nail Knite       | 0.13       | $123.30
70012        | 2019-06-27 | $250.45         | Jilian Green  | 300   | Nail Knite       | 0.13       | $32.56
70004        | 2019-08-17 | $110.50         | Gina Cameron  | 100   | Layla Ahmad      | 0.12       | $13.26
70003        | 2019-10-10 | $2,480.40       | Gina Cameron  | 100   | Layla Ahmad      | 0.12       | $297.65
70009        | 2019-09-10 | $270.65         | Corey Jackson | 200   | Amoli Alex       | 0.11       | $29.77
... (2 rows omitted)

**Question 7.** Use the `join` method to make the table below.

**Hint 1:** Use the `np.unique()` function to return the unique elements from the `Salesperson Name` column.

In [10]:
# Question 8

Salesperson Name | Total Sales
Adam Plank       | $75
Amoli Alex       | $271
James Hoog       | $11,271
Layla Ahmad      | $2,591
Mike Lyon        | $1,983
Nail Knite       | $1,349